/**
 * 자바스크립트는 동적 약형 프로그래밍 언어로
 * 해석형 언어이프로 전송 중에 컴파일 된다.
 * 다른 프로그래밍 언어처럼 개발 중에 컴파일 되는것이 아니라,
 * 실행되기 전에 컴파일 됩니다.
 * 호스팅된 언어이므로 여러 환경에서 실행이 됩니다.
 * 
 * 하지만 동적, 약형 , 해석형 및 호스팅된 언어란 정확히 무슨 의미일까요?
 * 
 * 해석형,즉석(on the fly)컴파일링이란 무슨 의미인가?
 * 
 * 
 * 엔진이 컴파일되지 않은 코드를 실행하기 시작한 후 더 빠른 실행을 시작하기 위해 이미 실행중인 코드를
 * 컴파일 하고 그다음 컴파일된 코드로 동적으로 전환하는 등의 작업이 일어남
 * 간단히 요약하면 > 브라우저에는 코드를 가져와서 컴파일하고 최적화하고 실행하는 내장 도구가 있고,
 * 이 모든 작업은 단일 스레드환경에서 실행된다
 * 
 * 동적, 약형?
 * 동적 해석형 언어란 ? 미리 컴파일되지 않았음을 의미
 * c++와 같은 다른 언어는 개발 중 또는 개발 후에 컴파일됩니다.
 * 반면 Js는 전송 중 컴파일링이기 때문에 코드가 런타임에 평가되고 실행됨.
 * 이는 또한 코드가 런타임에서 변경될 수 있음을 의미
 * 
 * js에서 '동적'이라는 것은 런타임에 분석 및 해석이 되어 컴파일 되기 때문에 
 * 특정 작업의 수행이 가능해진다
 * 
 * 결론으로 => 수행 중 컴파일링과 해석.
 * 
 * 약형은? js에서 텍스트 데이터나 숫자와 같은 데이터로 작업 할 때에는, Js에
 * 텍스트 또는 숫자로 작업 할 것이라고 알려 줄 필요가 없음
 * 데이터 유형을 가정해 , 자동으로 유추되기 때문
 * 이는 데이터 유형이 코드 한줄마다 변경될 수도 있다라는 동적 특성과 관련이 있음
 */